Autodesk.Revit.DB.ModelText.Subcategory
The subcategory.
Remarks: The subcategory can be set to either the family category or one of its subcategories.

Autodesk.Revit.DB.ModelText.ModelTextType
The type for the model text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when null is assigned to this property.

Autodesk.Revit.DB.ModelText.HorizontalAlignment
The horizontal alignment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when an invalid value is assigned to the property.

Autodesk.Revit.DB.ModelText.Depth
The depth of the model text.

Autodesk.Revit.DB.ModelText.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility for the model text in a family document.
Remarks: The visibility of the model text geometry can be changed for different
types of views and detail levels in the family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed, or the model curve is in a project document.

Autodesk.Revit.DB.ModelText.GetVisibility
Gets the visibility for the model text in a family document.
Returns: A copy of visibility settings for the model text in a family document.

Autodesk.Revit.DB.ModelText.Location
This property is used to find the physical location of an instance within project.

Autodesk.Revit.DB.ModelText.Text
The text string in the model text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when null is assigned to text.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when an empty string is assigned to text.

Autodesk.Revit.DB.ModelText
A model text element in an Autodesk Revit family document.